HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCbs_bf.h
/** \brief Offset for Ifx_CBS_IFSA_Bits.ADDR */
#define IFX_CBS_IFSA_ADDR_OFF (0u)

/** \brief Length for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_OFF (0u)

/** \brief Length for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_OFF (1u)

/** \brief Length for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_OFF (2u)

/** \brief Length for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_OFF (3u)

/** \brief Length for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_LEN (4u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_MSK (0xfu)

/** \brief Offset for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_OFF (8u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_OFF (16u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_OFF (18u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_OFF (20u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_OFF (22u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_OFF (24u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_OFF (26u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_OFF (28u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM7 */
#define IFX_CBS_IFSC_BM7_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM7 */
#define IFX_CBS_IFSC_BM7_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM7 */
#define IFX_CBS_IFSC_BM7_OFF (30u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_OFF (0u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_OFF (1u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_OFF (2u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_OFF (3u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_OFF (4u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_5 */
#define IFX_CBS_TRIG_TRGX_5_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_5 */
#define IFX_CBS_TRIG_TRGX_5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_5 */
#define IFX_CBS_TRIG_TRGX_5_OFF (5u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_6 */
#define IFX_CBS_TRIG_TRGX_6_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_6 */
#define IFX_CBS_TRIG_TRGX_6_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_6 */
#define IFX_CBS_TRIG_TRGX_6_OFF (6u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_7 */
#define IFX_CBS_TRIG_TRGX_7_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_7 */
#define IFX_CBS_TRIG_TRGX_7_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_7 */
#define IFX_CBS_TRIG_TRGX_7_OFF (7u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_8 */
#define IFX_CBS_TRIG_TRGX_8_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_8 */
#define IFX_CBS_TRIG_TRGX_8_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_8 */
#define IFX_CBS_TRIG_TRGX_8_OFF (8u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_9 */
#define IFX_CBS_TRIG_TRGX_9_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_9 */
#define IFX_CBS_TRIG_TRGX_9_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_9 */
#define IFX_CBS_TRIG_TRGX_9_OFF (9u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_OFF (10u)

