HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCbs_bf.h
/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_OFF (11u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_OFF (12u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_OFF (13u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_OFF (14u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_OFF (15u)

/** \brief Length for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_LEN (8u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_MSK (0xffu)

/** \brief Offset for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_OFF (24u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN0 */
#define IFX_CBS_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN0 */
#define IFX_CBS_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN0 */
#define IFX_CBS_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN1 */
#define IFX_CBS_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN1 */
#define IFX_CBS_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN1 */
#define IFX_CBS_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN2 */
#define IFX_CBS_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN2 */
#define IFX_CBS_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN2 */
#define IFX_CBS_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN3 */
#define IFX_CBS_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN3 */
#define IFX_CBS_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN3 */
#define IFX_CBS_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN4 */
#define IFX_CBS_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN4 */
#define IFX_CBS_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN4 */
#define IFX_CBS_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN5 */
#define IFX_CBS_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN5 */
#define IFX_CBS_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN5 */
#define IFX_CBS_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN6 */
#define IFX_CBS_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN6 */
#define IFX_CBS_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN6 */
#define IFX_CBS_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN7 */
#define IFX_CBS_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN7 */
#define IFX_CBS_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN7 */
#define IFX_CBS_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN8 */
#define IFX_CBS_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN8 */
#define IFX_CBS_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN8 */
#define IFX_CBS_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN9 */
#define IFX_CBS_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN9 */
#define IFX_CBS_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN9 */
#define IFX_CBS_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN10 */
#define IFX_CBS_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN10 */
#define IFX_CBS_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN10 */
#define IFX_CBS_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN11 */
#define IFX_CBS_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN11 */
#define IFX_CBS_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN11 */
#define IFX_CBS_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN12 */
#define IFX_CBS_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN12 */
#define IFX_CBS_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN12 */
#define IFX_CBS_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN13 */
#define IFX_CBS_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN13 */
#define IFX_CBS_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN13 */
#define IFX_CBS_ACCEN0_EN13_OFF (13u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN14 */
#define IFX_CBS_ACCEN0_EN14_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN14 */
#define IFX_CBS_ACCEN0_EN14_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN14 */
#define IFX_CBS_ACCEN0_EN14_OFF (14u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN15 */
#define IFX_CBS_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN15 */
#define IFX_CBS_ACCEN0_EN15_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN15 */
#define IFX_CBS_ACCEN0_EN15_OFF (15u)

/** \brief Length for Ifx_CBS_ACCEN0_Bits.EN16 */
#define IFX_CBS_ACCEN0_EN16_LEN (1u)

/** \brief Mask for Ifx_CBS_ACCEN0_Bits.EN16 */
#define IFX_CBS_ACCEN0_EN16_MSK (0x1u)

/** \brief Offset for Ifx_CBS_ACCEN0_Bits.EN16 */
#define IFX_CBS_ACCEN0_EN16_OFF (16u)

